app/controllers/likes_controller.rb

  def create
    @like = Like.new(user: @user, post: @post)

    if @like.save
      @post.increment!(:like_counter)
---
UPDATE "posts" SET "like_counter" = COALESCE("like_counter", 0) + $1 WHERE "posts"."id" = $2  [["like_counter", 1], ["id", 4]]