app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]