app/models/comment.rb

UPDATE "posts" SET "comment_counter" = COALESCE("comment_counter", 0) + $1 WHERE "posts"."id" = $2  [["comment_counter", 1], ["id", 4]]
---
  def update_comments_counter
    post.increment!(:comment_counter)